namespace project
{
    internal class Program
    {
        static void Main(string[] args)
        {

            // Однострочные комментарии
            // Создание переменной
            // тип_данных имя_переменной = значение;

            // Типы вывода информации в консоль
            /*int age = 25;
            string name = "Dima";*/
            // Ctrl + Shift + / - Комментирование выделенного кода многострочным комментарием

            // Вывод информации в консоль с использованием конкатенации строк
            // Не рекомендуется использовать конкатенацию строк для вывода информации в консоль, из-за переполнения памяти и снижения производительности.
            // Console.WriteLine("Hello, my name is " + name + " and I am " + age + " years old.");

            // Вывод информации в консоль с форматированием строк
            // Console.WriteLine("Hello, my name is {0} and I am {1} years old.", name, age);

            // Вывод информации в консоль с использованием интерполяции строк
            // Рекомендуется использовать интерполяцию строк для вывода информации в консоль, так как она более читаема и удобна в использовании.
            // Console.WriteLine($"Hello, my name is {name} and I am {age} years old.");

            // В С# используется кодировка UTF-16, которая поддерживает все символы Юникода, включая эмодзи. Поэтому можно использовать эмодзи в строках и выводить их в консоль.
            // Символы этой кодировки занимают 2 байта.
            // string name = "Dima";

            /*
            Console.Write("Введите имя: ");
            string name = Console.ReadLine();

            Console.Write("Введите возраст: ");
            int age = int.Parse(Console.ReadLine());

            Console.Write("Введите рост: ");
            float height = float.Parse(Console.ReadLine());

            Console.Write("Введите ваш пол (1 - мужской, 2 - женский): ");
            int gender = int.Parse(Console.ReadLine());

            Console.Write("Вам есть 18 лет? Ответ: ");
            bool isAdult = bool.Parse(Console.ReadLine());
            */

            // \n - символ новой строки, который используется для переноса текста на следующую строку.
            // \t - символ табуляции, который используется для выравнивания текста по горизонтали.
            // \r - символ возврата каретки, который используется для возврата курсора в начало строки.
            // \\ - символ обратного слэша, который используется для экранирования специальных символов.
            // \" - символ двойной кавычки, который используется для экранирования двойных кавычек в строках.

            /*
            Console.WriteLine("\nРезультат анкеты:");
            Console.WriteLine($"Имя: {name}");
            Console.WriteLine($"Возраст: {age}");
            Console.WriteLine($"Рост: {height}");
            Console.WriteLine($"Пол: {(gender == 1 ? "Мужской" : "Женский")}"); // Используется тернарный оператор для определения пола
            Console.WriteLine($"Совершеннолетний: {isAdult}");
            */

            // Домашнее задание:
            /*
             * 1. Почитать про системы счисления.
             * 2. Написать программу с анкетой, которая будет запрашивать у пользователя какие-то данные.
             * 3. Почитать про математические операторы и написать программу, которая решает след. математические выражения
             * Выражения на скриншоте в телеграмм
             */


            // Тесты
            string name = "Alex";
            int age = int.Parse("18");
            Console.WriteLine($"Hello, {name}! You are {age} years old.");


            // Начало домашнего задания:
        }
    }
}